// var type = decodeURIComponent($.getUrlParam('type'))

// var ww = $(window).width();
// var hh = parseInt(ww*0.57)
// $(".project_slider,.swiper-container").css({
//   'height': hh + 'px'
// })


var contentList = [
  {
    title: '董事/总建筑师',
    subtitle: '',
    img: '1',
    name: '凌克戈',
    school: '',
    honour: '国家一级注册建筑师',
    subhonour: '国家一级注册建筑师',
    content: [
      '荣获2005上海市建筑学会青年建筑师奖；2005（上海）第四届国际建筑师作品展一等奖；2006获得中国建筑学会45岁以下最高个人奖青年建筑师奖；2007年重庆大学主楼获中国建筑最高奖詹天佑奖；2009年获得《中国大饭店》中国十大原创酒店设计师；2009入选上海10位最具大师潜质建筑师；2009年申通集团办公楼获上海市优秀勘察设计一等奖；2009年世博中心获上海市建筑学会创作奖优秀奖。扬州瘦西湖虹桥坊项目荣获2013年全国人居经典建筑规划设计规划金奖/上海市建筑学会第六届建筑创作佳作奖;南京白云亭文化艺术中心项目获得2015年上海市建筑学会第六届建筑创作佳作奖/2016中国建筑学会建筑创作奖入围项目（建筑保护与再利用类）；江阴嘉荷酒店2015年上海市建筑学会第六届建筑创作优秀奖/2016中国建筑学会建筑创作奖入围项目（建筑保护与再利用类）；鲅鱼圈保利大剧院及图书馆（金泰文化艺术广场）项目荣获2015年上海市建筑学会第六届建筑创作优秀奖/2016中国建筑学会建筑创作奖入围项目（城市设计类）2017-2018年度中国建筑学会建筑设计奖-建筑幕墙专业奖一等奖。',
      '扬州虹桥坊、姑苏雅集、鲅鱼圈保利大剧院及图书馆、白云亭文化艺术中心、武汉西北湖双玺、北京恒泰广场、重庆大学建筑城规学院建卒厅改造、三亚棕榈泉度假区四季悬崖酒店 、厦门海悦山庄、三亚棕榈泉度假区四季沙滩酒店别墅区 、厦门东坪山高尔夫酒店、上海东郊宾馆北楼扩建、成都协信希尔顿酒店、重庆康德豪生酒店、绿地长岛艾美酒店、绿地三甲港铂瑞，铂骊，Q酒店集群'
    ],
    contentawards: [
      // '个人代表作品',
      // '扬州虹桥坊（建成）',
      // '姑苏雅集（建成）',
      // '鲅鱼圈保利大剧院及图书馆（建成）',
      // '白云亭文化艺术中心（建成）',
      // '武汉西北湖双玺（建成）',
      // '北京恒泰广场（建成）',
      // '重庆大学建筑城规学院建卒厅改造（建成）',
      // '三亚棕榈泉度假区四季悬崖酒店' ,
      // '厦门海悦山庄（建成）' ,
      // '三亚棕榈泉度假区四季沙滩酒店别墅区' ,
      // '厦门东坪山高尔夫酒店（建成）' ,
      // '上海东郊宾馆北楼扩建（建成）',
      // '成都协信希尔顿酒店（建成）',
      // '重庆康德豪生酒店（建成）',
      // '绿地长岛艾美酒店（建成）',
      // '绿地三甲港铂瑞，铂骊，Q酒店集群（建成）'
    ] 
  },
  {
    title: '创作总监',
    subtitle: '',
    img: '2',
    name: '胡威',
    school: '天津大学城市规划专业毕业',
    honour: '国家一级注册建筑师',
    subhonour: '国家一级注册建筑师',
    content: [
      '江苏广电城项目荣获2009年全国工程勘察设计行业三等奖/2009年上海市优秀工程勘察设计一等奖；扬州瘦西湖虹桥坊项目荣获2013年全国人居经典建筑规划设计规划金奖/上海市建筑学会第六届建筑创作佳作奖。',
      '江苏广电城、北京恒泰广场、扬州虹桥坊、成都协信中心办公楼及希尔顿酒店、永川协信中心、上海三甲港度假酒店群。'
    ],
    contentawards: [
      
    ] 
  },
  {
    title: '技术总监',
    subtitle: '',
    img: '3',
    name: '王利民',
    school: '同济大学建筑学硕士毕业',
    honour: '国家一级注册建筑师',
    subhonour: '国家一级注册建筑师',
    content: [
      '上海区域空中交通管制中心获得2005度上海市优秀工程设计二等奖；上海区域空中交通管制中心获得2005度建设部优秀勘察设计三等奖；上海区域空中交通管制中心第二届上海市建筑学会建筑创作奖佳作奖；东郊宾馆主楼、宴会楼获得2007度上海市优秀工程设计一等奖；福州世茂外滩花园2号楼获二ΟΟ八年上海市优秀住宅工程单体设计项目二等奖;扬州瘦西湖虹桥坊项目荣获2013年全国人居经典建筑规划设计规划金奖/上海市建筑学会第六届建筑创作佳作奖;南京白云亭文化艺术中心项目获得上海市建筑学会第六届建筑创作佳作奖/2016中国建筑学会建筑创作奖入围项目（建筑保护与再利用类）。',
      '扬州瘦西湖虹桥坊、南京白云亭文化艺术中心、成都协信希尔顿酒店、上海三甲港度假酒店群、武汉西北湖双玺、苏州姑苏雅集。'
    ],
  },
  {
    title: '副总经理',
    subtitle: '设计一部设计总监',
    img: '4',
    name: '刘轶佳',
    school: '同济大学建筑学硕士毕业',
    honour: '国家一级注册建筑师',
    subhonour: '国家一级注册建筑师',
    content: [
      '扬州瘦西湖虹桥坊项目荣获2013年全国人居经典建筑规划设计规划金奖/上海市建筑学会第六届建筑创作佳作奖；江阴嘉荷精品酒店荣获2015年获上海市建筑学会创作奖优秀奖/2016中国建筑协会建筑创作奖入围项目（建筑保护与再利用类）。',
      '江阴嘉荷精品酒店、成都协信希尔顿酒店、上海三甲港度假酒店群、绿地长岛艾美酒店及会议中心、扬州虹桥坊、烟台龙湖领导力学院。'
    ],
  },
  {
    title: '运营总监（COO）',
    subtitle: '设计二部设计总监',
    img: '5',
    name: '徐燕宁',
    school: '',
    honour: '国家一级注册建筑师',
    subhonour: '国家一级注册建筑师 / 高级工程师 / PMP项目管理美国认证专业人员',
    content: [
      '徐州洲际酒店  2014年优质服务奖；西安临潼悦椿温泉酒店 2015年上海市优秀勘察设计项目一等奖；亚特兰蒂斯水上乐园项目 2016年度优秀工程二等奖；镇江金山湖旅游设施建设项目 2016年度优秀方案佳作奖；上海市第二轮市级志书编撰酒店部分负责人。',
      '三亚雅居乐希尔顿度假酒店、西安临潼悦椿温泉酒店、海南亚特兰蒂斯项目水上乐园工程、济南中弘广场17#地块商业酒店综合体项目、镇江金山湖旅游设施建设项目、徐州洲际酒店、三亚嘉悦海岸中心凯悦酒店群'
    ],
  },
  {
    title: '设计三部设计总监',
    subtitle: '',
    img: '6',
    name: '黄瓯海',
    school: '',
    honour: '国家一级注册建筑师/高级工程师',
    subhonour: '国家一级注册建筑师/高级工程师',
    content: [
      '荣获2017年上海市工程质量建设能手； 2010 世博会中国船舶馆获上海市建筑创作奖优秀奖、上海市优秀勘察设计二等奖；上海船厂2E2-4 地块 （陆家嘴展览中心） 获 2017 年上海市优秀勘察设计奖二等奖；苏州龙潭苑 获2012 年度上海市优秀勘察( 住宅小区) 设计奖二等奖。',
      '上海世博会中国船舶馆、奥克兰丽丝卡尔顿酒店、上海静安万枫酒店、上海陆家嘴展览中心、杨浦区149街坊总部办公楼、仪征技师学院、宁波万科电商产业园'
    ],
  },
  {
    title: '设计四部设计总监',
    subtitle: '',
    img: '7',
    name: '李炼',
    school: '',
    honour: '',
    content: [
     '2018年加入上海都设营造建筑设计事务所有限公司，任设计四部设计总监。',
     '佛山万科天傲湾、佛山万科翡翠滨江、成都万科五龙山九墅、成都万科公园5号'
    ],
  },
  {
    title: '设计一部设计副总监',
    subtitle: '',
    img: '8',
    name: '熊文昱',
    school: '',
    honour: '国家一级注册建筑师',
    subhonour: '国家一级注册建筑师',
    content: [
     '轨道交通十号线吴中路停车场地块项目荣获，2017年度上海优秀勘察设计项目三等奖，上海市创新城市品质建筑奖。',
     '长沙宜家购物中心、黄浦区160街坊保护性综合改造项目、轨道交通十号线吴中路停车场地块项目、昆明润城第二大道项目、昆明天娇城四期商业项目'
    ],
  },
  {
    title: '设计二部设计副总监',
    subtitle: '',
    img: '9',
    name: '孔君涛',
    school: '',
    honour: '',
    subhonour: '',
    content: [
     '设计二部副总监孔君涛，是中国清华大学建筑学学士、硕士，硕士毕业论文《商务区设计控制研究—以上海虹桥商务区08地块为例》获清华大学建筑学院优秀毕业论文。',
     '广西百色干部学院、上海张江中区C-5-2商办项目、安徽黄山鲁徽大酒店、安徽合肥翡翠湖迎宾馆扩建工程、北京会议中心一号楼改建项目、安徽合肥为民服务中心、武汉鄂旅投珞珈国际项目等。其中广西百色干部学院获第七届上海建筑学会建筑创作奖优秀奖、2017年度上海市优秀工程设计一等奖。安徽黄山鲁徽商会酒店获第七届上海市建筑学会建筑创作奖佳作奖。 '
    ],
  }
]

  
var header = require('../components/Header.vue')
var footer = require('../components/Footer.vue') 
var app = new Vue({
  el: '#app',
  components: {
    'duHeader' : header,
    'duFooter' : footer
  },
  data: {
    // type: type,
    contentList: contentList,
    mask: {},
    imgIndex: 0,
    show_mask: false
  },
  computed: {
  },
  created: function(){

  },
  mounted: function(){
    const self = this;
    var ww = document.body.clientWidth - 100;
    var clientWidth = document.documentElement.clientWidth
    var clientHeight = document.documentElement.clientHeight

    $(".mask_cotent").css({
      'width': (clientWidth*0.6).toFixed(2),
      'height': (clientHeight*0.8).toFixed(2),
      'top': '10%',
      'left': '20%',
    })

    $(window).resize(function(){
      var ww = document.body.clientWidth - 100;
      var clientWidth = document.documentElement.clientWidth
      var clientHeight = document.documentElement.clientHeight

      $(".mask_cotent").css({
        'width': (clientWidth*0.6).toFixed(2),
        'height': (clientHeight*0.8).toFixed(2),
        'top': '10%',
        'left': '20%',
      })
    })
  },
  methods: {

    showDetail: function(item) {
      this.mask = item
      setTimeout(function(){
        $(".mask").show()
      },200)
    },

    closeMask: function(){
      $(".mask").hide()
      this.imgIndex = -1;
      this.mask = {}
    }
  }
})